Revit 2027 API
FluidTemperature.Temperature Property
 The temperature value
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Temperature { get; set; }
Public Property Temperature As Double
	Get
	Set
public:
property double Temperature {
	double get ();
	void set (double value);
}
member Temperature : float with get, set
Property Value
Double
See Also
Reference
FluidTemperature Class
Autodesk.Revit.DB.Plumbing Namespace